[
  {"Title":"Front End Developer","Location":"Pune, Maharashtra, India","Company":"KPMG India","link":"https:\/\/in.linkedin.com\/jobs\/view\/front-end-developer-at-kpmg-india-3776828563?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=7DeN%2F8IGCMxzkaQyIxcvVQ%3D%3D&position=1&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":""},
  {"Title":"Software Developer","Location":"Pune, Maharashtra, India","Company":"UPstack Solutions Pvt Ltd","link":"https:\/\/in.linkedin.com\/jobs\/view\/software-developer-at-upstack-solutions-pvt-ltd-3656598136?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=4egLOeyRUEziJOBDQaLfuw%3D%3D&position=2&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"Bachelor’s degree in computer science, software engineering, or a related fieldExperience writing code in Java, JavaScript, HTML, CSS, and C# Experience using SQL to update and retrieve dataExperience in front-end or back-end software development for UNIX or LINUXExperience with .Net and AngularJS \/ React \/ Vue frameworksExperience with database management and security a plusAnalytical skillsCommunication skillsSkills:- MongoDB and Express"},
  {"Title":"Software Development Engineer","Location":"Pune, Maharashtra, India","Company":"Xpressbees (BusyBees Logistics Solutions Pvt. Ltd.)","link":"https:\/\/in.linkedin.com\/jobs\/view\/software-development-engineer-at-xpressbees-busybees-logistics-solutions-pvt-ltd-3627613617?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=NcNqX5uX7xuCBKawmMI06Q%3D%3D&position=3&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"Company ProfileXpressBees– a logistics company started in 2015 – is amongst the fastest growing companies of itssector. While we started off rather humbly in the space of ecommerce B2C logistics, the last 5 yearshave seen us steadily progress towards expanding our presence. Our vision to evolve into a strong full-service logistics organization reflects itself in our new lines of business like 3PL, B2B Xpress and crossborder operations.Our strong domain expertise and constant focus on meaningful innovation have helped us rapidly evolveas the most trusted logistics partner of India. We have progressively carved our way towards best-in-class technology platforms, an extensive network reach, and a seamless last mile management system.While on this aggressive growth path, we seek to become the one-stop-shop for end-to-end logisticssolutions. Our big focus areas for the very near future include strengthening our presence as serviceproviders of choice and leveraging the power of technology to improve efficiencies for our clients.Job DescriptionXB is looking for driven & talented engineers to build highly scalable, reliable and performant cloud-based platforms to drive the logistics business. You will have opportunities to make a big impact at XBon the software solutions being built for Logistics businesses. We build a variety of technology productsthat span multiple businesses.The challenges that SDEs at XB solve are big (handle 50 Lakh shipments per day!) and influence the E-Commerce business in India in coming years. We are looking for individuals who are passionate aboutcreating new products, features, and services from scratch while managing ambiguity and the fast paceof the company. The challenges span areas like highly scalable and reliable orchestrationplatforms, Client Integration API frameworks, Billing Solutions, Workforce Engagement. Further you maysolve complex optimization problems like Vehicle routing, Allocation, Network Optimization etc.Roles & Responsibilities You will be responsible for working with cross functional teams to deep dive into thebusiness and technology problems related to our portfolio of products, understanding thegaps that exist in our current tools, and work within our team and with partner teams todesign best in class solutions. You will have the opportunity to influence, invent, and design system architectureacross multiple product and technology spaces. You will lead and mentor other talented engineers. You will be responsible for buildingthe best customer experience, keeping latency, security, and usability in mind. You will interact with Product Managers and Designers and convert their vision intoa technical solution. You will own portions of software deliverables including major critical path code fromyour designs while finding opportunities to grow and mentor the team around you. You will collaborate with other engineering leads and guide the team on softwaredevelopment best practices and set examples by using them in solutions that you build. You will own the end-to-end design of major deliverables, working closely with a teamof SDEs and Front-End Engineers to execute them. This is a high visibility and fast-pacedenvironment where you will make a direct impact on the customer experience and thebottom line of the company. You should have a commanding understanding of object-oriented design, datastructures and algorithms which you use to mentor a team of engineers. You should haveexperience with agile methodologies, experience building scalable services and robust userinterfaces. We make extensive use of AWS Services (API Gateway, Lambda, SQS, etc.) andprior experience is a plus. Experience with modern JavaScript frameworks (like angular,react, backbone, and node.js) would be a plus.Qualifications Experience developing cloud software services and an understanding of design forscalability, performance, and reliability. Development experience defining, developing and maintaining web service API's Demonstrated ability to mentor other software developers to maintain architecturalvision and software quality. Experience in communicating with users, other technical teams, and seniormanagement to collect requirements, describe software product features, technical designs,and product strategy. Experience taking a leading role in building complex software systems that have beensuccessfully delivered to customers. Knowledge of professional software engineering practices & best practices for the fullsoftware development life cycle, including coding standards, code reviews, source controlmanagement, build processes, testing, and operations. Experience with distributed computing and enterprise-wide systems Deep understanding of CS fundamentals including data structures, algorithms andcomplexity analysis. Experience building large-scale, high-performance systems in a complex, multi-tiered,distributed environment. Design and architecture expertise as well as familiarity with object-oriented analysis anddesign patterns (OOA\/OOD). Ability to thrive in a fast-paced, dynamic environment. Skills:- Data Structures, Algorithms, Java and Python"},
  {"Title":"Full Stack Engineer","Location":"Pune, Maharashtra, India","Company":"Easebuzz","link":"https:\/\/in.linkedin.com\/jobs\/view\/full-stack-engineer-at-easebuzz-3625371911?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=0CciDLfGcGMzUIqWR3ho1A%3D%3D&position=4&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"Company ProfileEasebuzz is a payment solutions (fintech organisation) company which enables online merchants to accept, process and disburse payments through developer friendly APIs. We are focusing on building plug n play products including the payment infrastructure to solve complete business problems. Definitely a wonderful place where all the actions related to payments, lending, subscription, eKYC is happening at the same time.We have been consistently profitable and are constantly developing new innovative products, as a result, we are able to grow 4x over the past year alone. We are well capitalised and have recently closed a fundraise of $4M in March, 2021 from prominent VC firms and angel investors. Easebuzz’s corporate culture is tied into the vision of building a workplace which breeds open communication and minimal bureaucracy. An equal opportunity employer, we welcome and encourage diversity in the workplace. One thing you can be sure of is that you will be surrounded by colleagues who are committed to helping each other grow.Easebuzz Pvt. Ltd. has its presence in Pune, Mumbai, Bangalore, GurugramJob DescriptionWe are looking for a Full Stack Developer responsible for managing the interchange of data between the server and the users. Your primary focus will be the development of all server-side logic, ensuring high performance and responsiveness to requests from the front end.At EaseBuzz, every individual is honed to be a leader and enjoys the freedom to make decisions that she\/he sees fit to steer the organization closer towards its goals. We work in small, decentralized teams that promote independent authority and freedom to approach and solve problems creatively. This path nurtures the artisan in every individual and brings to fruition the vision of crafting purpose-built solutions for clients.Qualifications And Education RequirementsExpert in Python, with knowledge of Python web framework (such as Django, Flask, etc depending on your technology stack)Excellent knowledge of programming languages (PHP,Python preferred) along with JavaScript, Jquery, Angular-JS.Should be very well versed with database queries like mysql,etc.Familiarity with some ORM (Object Relational Mapper) librariesAble to integrate multiple data sources and databases into one system.Understanding of the threading limitations of Python, and multi-process architecture.Basic understanding of front-end technologies, such as JavaScript, HTML5, and CSS3.Understanding of accessibility and security compliance.Knowledge of user authentication and authorization between multiple systems, servers, and environments.Understanding of fundamental design principles behind a scalable application.Understanding of the differences between multiple delivery platforms, such as mobile vs desktop, and optimizing output to match the specific platform.Able to create database schemas that represent and support business processes.Strong unit test and debugging skills.Good communication skills and excellent problem-solving capabilitiesRole And ResponsibilitiesWork on complex, custom-designed, scalable, multi-tiered software development projects Design and implementation of low-latency, high-availability, and performance applicationsIntegration of user-facing elements developed by front-end developers with server-side logicImplementation of security and data protectionBe responsible for the quality of software and resolving any issues regards the solution Think through hard problems, not limited to technology, and work with a team to realize and implement solutions and Learn something new every day. Employment TypeFull-TimeWork LocationPune\/Bangalore"},
  {"Title":"Software Engineer Backend (3-5yrs)","Location":"Pune, Maharashtra, India","Company":"PhonePe","link":"https:\/\/in.linkedin.com\/jobs\/view\/software-engineer-backend-3-5yrs-at-phonepe-3665122660?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=rRNDIBkn804dpZrVmG1TeA%3D%3D&position=5&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"About PhonePe Group: PhonePe is India’s leading digital payments company with 50 crore (500 Million) registered users and 3.7 crore (37 Million) merchants covering over 99% of the postal codes across India. On the back of its leadership in digital payments, PhonePe has expanded into financial services (Insurance, Mutual Funds, Stock Broking, and Lending) as well as adjacent tech-enabled businesses such as Pincode for hyperlocal shopping and Indus App Store which is India's first localized App Store. The PhonePe Group is a portfolio of businesses aligned with the company's vision to offer every Indian an equal opportunity to accelerate their progress by unlocking the flow of money and access to services.CultureAt PhonePe, we take extra care to make sure you give your best at work, Everyday! And creating the right environment for you is just one of the things we do. We empower people and trust them to do the right thing. Here, you own your work from start to finish, right from day one. Being enthusiastic about tech is a big part of being at PhonePe. If you like building technology that impacts millions, ideating with some of the best minds in the country and executing on your dreams with purpose and speed, join us!ChallengesBuilding for Scale, Rapid Iterative Development, and Customer-centric Product Thinking at each step defines every day for a developer at PhonePe. Though we engineer for a 50million+ strong user base, we code with every individual user in mind. While we are quick to adopt the latest in Engineering, we care utmost for security, stability, and automation. Apply if you want to experience the best combination of passionate application development and product-driven thinkingAs a Software Engineer:You will build Robust and scalable web-based applications You will need to think of platforms & reuseBuild abstractions and contracts with separation of concerns for a larger scopeDrive problem-solving skills for high-level business and technical problems.Do high-level design with guidance; Functional modeling, break-down of a moduleDo incremental changes to architecture: impact analysis of the sameDo performance tuning and improvements in large scale distributed systemsMentor young minds and foster team spirit, break down execution into phases to bring predictability to overall executionWork closely with Product Manager to derive capability view from features\/solutions, Lead execution of medium-sized projectsWork with broader stakeholders to track the impact of projects\/features and proactively iterate to improve them As a senior software engineer you must haveExtensive and expert programming experience in at least one general programming language (e.g. Java, C, C++) & tech stack to write maintainable, scalable, unit-tested code.Experience with multi-threading and concurrency programmingExtensive experience in object-oriented design skills, knowledge of design patterns, and huge passion and ability to design intuitive module and class-level interfacesExcellent coding skills – should be able to convert the design into code fluentlyKnowledge of Test Driven DevelopmentGood understanding of databases (e.g. MySQL) and NoSQL (e.g. HBase, Elasticsearch, Aerospike, etc)Strong desire to solving complex and interesting real-world problemsExperience with full life cycle development in any programming language on a Linux platformGo-getter attitude that reflects in energy and intent behind assigned tasksWorked in a startups environment with high levels of ownership and commitmentBTech, MTech, or Ph.D. in Computer Science or related technical discipline (or equivalent).Experience in building highly scalable business applications, which involve implementing large complex business flows and dealing with a huge amount of data.3 + years of experience in the art of writing code and solving problems on a Large Scale.An open communicator who shares thoughts and opinions frequently listens intently and takes constructive feedback.As a Software Engineer, good to haveThe ability to drive the design and architecture of multiple subsystemsAbility to break-down larger\/fuzzier problems into smaller ones in the scope of the productUnderstanding of the industry’s coding standards and an ability to create appropriate technical documentation.PhonePe Full Time Employee Benefits (Not applicable for Intern or Contract Roles)Insurance Benefits - Medical Insurance, Critical Illness Insurance, Accidental Insurance, Life InsuranceWellness Program - Employee Assistance Program, Onsite Medical Center, Emergency Support SystemParental Support - Maternity Benefit, Paternity Benefit Program, Adoption Assistance Program, Day-care Support ProgramMobility Benefits - Relocation benefits, Transfer Support Policy, Travel PolicyRetirement Benefits - Employee PF Contribution, Flexible PF Contribution, Gratuity, NPS, Leave Encashment Other Benefits - Higher Education Assistance, Car Lease, Mobile & Broadband Reimbursements, Salary Advance PolicyWorking at PhonePe is a rewarding experience! Great people, a work environment that thrives on creativity, the opportunity to take on roles beyond a defined job description are just some of the reasons you should work with us. Read more about PhonePe on our blog.Life at PhonePePhonePe in the news"},
  {"Title":"Python Developer Freshers","Location":"Pune, Maharashtra, India","Company":"Pinnacle Tech Systems","link":"https:\/\/in.linkedin.com\/jobs\/view\/python-developer-freshers-at-pinnacle-tech-systems-3735520471?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=rh2kUk2yBk7BXBBu4Z23kQ%3D%3D&position=6&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"We are hiring for our client company.Currently we have requirement for Python developer fresherJob Location:- PunePkg:- 4.2 LPAFor more details visit below office addressPinnacle Tech SystemsOffice no.3, 1st floor, Grow work Business Park,Old Mumbai Pune highway, beside bhojwani sweet,dapodi, Pune- 411012.Monday to Saturday10am to 5pmSkills: python developer,python.,problem solving,software development,python"},
  {"Title":"python Developer","Location":"Pune, Maharashtra, India","Company":"CN Solutions","link":"https:\/\/in.linkedin.com\/jobs\/view\/python-developer-at-cn-solutions-3707652018?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=08U8SmhyQOJcVa9lPkXIsQ%3D%3D&position=7&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"Company OverviewCN Solutions is a leading IT services and IT consulting company with expertise in various domains including Web Technologies, Databases, Software Testing, CRM, ERP, Data warehousing, Middleware, ESM, Business Analyst, Cyber Security, and SAP Hiring. We provide a range of services including Staffing Solutions, Leadership Hiring, RPO, and General Staffing. With a team of highly experienced professionals, we are dedicated to delivering first-class solutions to our clients' manpower requirements.Job OverviewWe are seeking a talented Python Developer to join our team at CN Solutions. As a Python Developer, you will be responsible for developing and maintaining high-quality software applications using Python programming language. This is a full-time position based in Pune, Maharashtra, India. The ideal candidate should have 1 to 3 years of experience as a Junior Python Developer.Qualifications And SkillsBachelor's degree in Computer Science, Engineering, or a related field1 to 3 years of experience as a Junior Python DeveloperStrong knowledge of Python programming languageExperience with Python frameworks such as Django or FlaskFamiliarity with front-end technologies such as HTML, CSS, and JavaScriptGood understanding of software development principles and best practicesAbility to work in a fast-paced and collaborative environmentExcellent problem-solving and communication skillsAttention to detail and strong organizational skillsRoles And ResponsibilitiesDesigning and implementing software applications using Python programming languageCollaborating with cross-functional teams to define, design, and ship new featuresMaintaining and enhancing existing software applicationsWriting clean, maintainable, and efficient codeTroubleshooting and debugging issues in the software applicationsPerforming unit testing and ensuring software qualityKeeping up-to-date with the latest industry trends and technologies"},
  {"Title":"Junior Software Developer","Location":"Pune, Maharashtra, India","Company":"Renee Technologies","link":"https:\/\/in.linkedin.com\/jobs\/view\/junior-software-developer-at-renee-technologies-3761409801?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=Lfg1cQh%2FGz09wWZWR6RsCQ%3D%3D&position=8&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"About UsAt Renee Technologies, we're dedicated to driving business success through innovative IT solutions. As a Junior Software Developer on our team, you'll have the opportunity to work on impactful projects and collaborate with experienced professionals in a dynamic and growth-oriented environment.ResponsibilitiesCollaborate with senior developers to design, develop, and maintain software applications that meet business needs.Write clean, efficient, and well-documented code using best practices.Participate in code reviews and contribute to continuous improvement of coding standards.Debug and troubleshoot issues to ensure software quality and performance.Work closely with cross-functional teams to understand project requirements and deliver solutions on time.QualificationsBachelor's degree in Computer Science, Software Engineering, or a related field (or equivalent experience).Proficiency in programming languages such as HTML, CSS, PHP.Understanding of software development principles, algorithms, and data structures.Familiarity with web development technologies, frameworks, and version control systems.Strong problem-solving skills and attention to detail.Effective communication skills and the ability to collaborate within a team.Additional InformationThis is a full-time position based at our Pune office.We offer a competitive salary, benefits package, Family Insurance and opportunities for professional growth.Diversity and inclusion are integral to our company culture.Skills: php,html,algorithms,attention to detail,programming languages,frameworks,collaboration,web development technologies,problem-solving skills,communication skills,css,data structures,software development principles,version control systems"},
  {"Title":"Jr Software Engineer","Location":"Pune, Maharashtra, India","Company":"SA Technologies Inc.","link":"https:\/\/in.linkedin.com\/jobs\/view\/jr-software-engineer-at-sa-technologies-inc-3774562564?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=fCXbiW1POUbxyeg0k%2FDNUQ%3D%3D&position=9&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"Unlock New Career Horizons with SA Technologies Inc.Were Hiring: Jr Software Engineer in Pune.At SA Technologies Inc., we believe in turning career aspirations into reality. As a Great Place to Work Certified company, recognized as one of the Best Places for Women, and a CMMI Level 5 Company, we are committed to creating a workplace that is inclusive, excellent, and supportive. Job Description:Be hands-on and ship good quality code Fast. Execute and deploy technical solutions and improvements. Understand existing code, maintain and improve it. Control Technical Debt. Help other team members in technologies, languages, and frameworks. Ensure healthy software engineering practices like planning, estimation, documentation, code review. Qualifications –1+ years of Hands-on experience in Java, Spring Boot, Spring MVC, Hibernate, Play. Hands on experience in SQL and NoSQL databases like Postgres, MongoDB, ElasticSearch, Redis Why SA Technologies Inc.? Empowering Work Environment: A Great Place to Work, especially celebrated as one of the Best Places for Women. Excellence and Quality: A CMMI Level 5 Company, ensuring operational and service excellence. Globally Acclaimed:  A Microsoft Gold Partner and Google Partner, with over 20 years of global IT consulting and Development solutions delivery.Have queries? We’re here to assist you! Chat live with our recruiter or connect with the job owner directly: Email: asha.a@satincorp.co.in Contact Number:  8035234066Embark on a rewarding journey together with us! At SA Technologies Inc., your journey begins with a friendly technical assessment, providing a stage to highlight your unique skills."},
  {"Title":"Backend Developer","Location":"Pune, Maharashtra, India","Company":"Easebuzz","link":"https:\/\/in.linkedin.com\/jobs\/view\/backend-developer-at-easebuzz-3627612913?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=NDHe%2FQlt96l%2FrgUFNSTdzg%3D%3D&position=10&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":""},
  {"Title":"Python Developer Freshers","Location":"Pune, Maharashtra, India","Company":"Pinnacle Tech Systems","link":"https:\/\/in.linkedin.com\/jobs\/view\/python-developer-freshers-at-pinnacle-tech-systems-3782263487?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=4PobxBok5oxtpfss1cef3A%3D%3D&position=11&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"Company OverviewPinnacle Tech Systems is a leading technology solutions provider in the None industry. With a focus on innovation and customer satisfaction, we strive to deliver top-notch services to our clients.Role And ResponsibilitiesAs a Python Developer Fresher, you will be responsible for:Developing and maintaining Python-based applicationsWriting efficient, reusable, and reliable codeCollaborating with cross-functional teams to design and implement solutionsIdentifying and fixing performance bottlenecks and bugsParticipating in code reviews to ensure qualityCandidate QualificationsTo be considered for this role, candidates should possess:Bachelor's degree in Computer Science or a related fieldKnowledge of Python programming languageUnderstanding of software development principles and practicesStrong problem-solving and analytical skillsAbility to work in a team environmentRequired SkillsWe are looking for candidates with the following skills:PythonSoftware DevelopmentProblem SolvingSkills: python.,python"},
  {"Title":"mysql developer","Location":"Pune, Maharashtra, India","Company":"YuktaMedia","link":"https:\/\/in.linkedin.com\/jobs\/view\/mysql-developer-at-yuktamedia-3656598371?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=l1v%2Fj0pVleF1Wu%2FpShuWaA%3D%3D&position=12&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"lean passionate team. fun culture. build innovative cool stuff. located in baner \/ aundh area Skills:- MySQL, Data Analytics and Database Design"},
  {"Title":"Software Developer","Location":"Pune, Maharashtra, India","Company":"Leap Info Systems Pvt. Ltd","link":"https:\/\/in.linkedin.com\/jobs\/view\/software-developer-at-leap-info-systems-pvt-ltd-3656597439?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=io22fon6K%2BjnE%2FxdfoJeog%3D%3D&position=13&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"About The CompanyLeap Info Systems Pvt. Ltd. - A software product company with its products and solutions in the convergent lighting controls and automation. Recently Leap acquired elitedali - worlds first Niagara based lighting controls and automation solution, from one of the leading US organization.We are a passionate team on a mission to develop innovative controls and automation products. We are expanding our product development team and are in search of like-minded highly passionate team members who would like to contribute to the leading lighting controls and automation product. We have customers in India, Europe, USA, and Australia.EligibilityAny suitable graduates (0 to 2 years experienced) who meet prescribed qualities and job responsibilities. Preferred but not limited to engineering graduate in Computer\/IT\/Instrumentation\/EnTC etc.Job ResponsibilitiesBe a part of the product development team for maintaining as well as developing new products based on JAVA and Niagara Software framework.QualitiesSelf-LearnerAnalytical skillsAble to work with Cross-functional teamProblem-solving approachGood Team Player with Positive vibesWhat You Must Have,Hands-on programming at academic or at the hobby level.Good knowledge of Java\/J2EE related technologiesGood knowledge of solution-based approachesGood communication skills - phone, email and in-person.What You Can Expect From LEAP,Positive conducive working environment to grow with cross-functional team members.Flexi working hours with defined responsibilities.Opportunity to work with leading open standard automation framework like Niagara Software, Lighting controls technologies like DALI, Wireless etcBe the active part of an emerging global product companySkills:- Java, Data Structures, Algorithms, Scala, C++, C#, Cisco Certified Network Associate (CCNA), Go Programming (Golang) and J2EE"},
  {"Title":"FirstCry - Intern - Search Engine Optimization","Location":"Pune, Maharashtra, India","Company":"FirstCry.com (BrainBees Solutions Pvt. Ltd.)","link":"https:\/\/in.linkedin.com\/jobs\/view\/firstcry-intern-search-engine-optimization-at-firstcry-com-brainbees-solutions-pvt-ltd-3781056772?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=ssekG5LxaN%2Fl%2BK69bIfW5Q%3D%3D&position=14&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"Job DescriptionThe responsibilities include but is not limited to keyword research, identifying content opportunities, creating SEO based content specifications outline, content management through our CMS\/backend systems, link building execution and if needed social content creation. Candidates will undergo training (relevant to the project and process).Project Description : (Project on which the new hire will work) :The project is pertaining to the Firstcry Shopping \/ Parenting.Roles And Responsibilities Content research & exploration based on the topic shared Keyword research META creation SEO research Content handling link building(ref:updazz.com)"},
  {"Title":"Mobile\/Device Tester - Quality Assurance","Location":"Pune, Maharashtra, India","Company":"Easebuzz","link":"https:\/\/in.linkedin.com\/jobs\/view\/mobile-device-tester-quality-assurance-at-easebuzz-3625375068?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=3U271qw8JrQYBA5YtCrgyg%3D%3D&position=15&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"About the Company Easebuzz is a payment solutions (fintech organisation) company which enables online merchants to accept, process and disburse payments through developer friendly APIs. We are focusing on building plug n play products including the payment infrastructure to solve complete business problems. Definitely a wonderful place where all the actions related to payments, lending, subscription, eKYC is happening at the same time. We have been consistently profitable and are constantly developing new innovative products, as a result, we are able to grow 4x over the past year alone. We are well capitalised and have recently closed a fundraise of $4M in March, 2021 from prominent VC firms and angel investors. Easebuzz’s corporate culture is tied into the vision of building a workplace which breeds open communication and minimal bureaucracy. An equal opportunity employer, we welcome and encourage diversity in the workplace. One thing you can be sure of is that you will be surrounded by colleagues who are committed to helping each other grow.Responsibilities Work with our proprietary Java and Kotlin based SDK to find performance and functionality related issues. Working with in-house Dashboards to perform testing of UI and APIs. Collaborating with teams to create test documents Planning and task management with the teamLooking For Expertise in testing different QA methodologies for both web UIs and backend both manually and automation. Ability to code and maintain back-end automation frameworks written in Python Ability to automate Android applications using tools such as Appium. Hands-on experience with API testing and testing tools like the postman or any other API testing tools. Excellent in test strategizing, planning, estimation, execution, and reporting. Working knowledge of Agile scrum methodologies. Strong debugging, problem-solving interpersonal, and troubleshooting skills"},
  {"Title":"Full Stack  - Fresher Training and Placements","Location":"Pune, Maharashtra, India","Company":"Optical Arc Pvt. Ltd.","link":"https:\/\/in.linkedin.com\/jobs\/view\/full-stack-fresher-training-and-placements-at-optical-arc-pvt-ltd-3778549111?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=o9QxnNVTHGNyFKHOjEtvMw%3D%3D&position=16&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"Job Title: Full Stack Developer - Fresher Training and PlacntJob Title: Full Stack Developer - Fresher Training and PlacementsCompany OverviewOptical Arc Pvt Ltd is seeking highly motivated and passionate individuals interested in pursuing a career as a Full Stack Developer. This is a training and placement opportunity for fresher candidates who have a strong desire to learn and excel in the field of web development.Position OverviewWe are looking for enthusiastic individuals to join our comprehensive training program designed to equip candidates with the skills necessary to become proficient Full Stack Developers. This role involves hands-on training in both front-end and back-end technologies, focusing on building robust and scalable web applications.ResponsibilitiesParticipate in a structured training program covering HTML, CSS, JavaScript, front-end frameworks (such as React, Angular, or Vue.js), and back-end technologies (such as Node.js, Python, or Java).Collaborate with mentors and trainers to understand best practices in software development and apply them to real-world projects.Engage in problem-solving and debugging exercises to enhance technical skills.Actively contribute to the development of web applications and projects under the guidance of senior developers.Demonstrate continuous learning and improvement in coding practices and development methodologies.RequirementsA degree in Computer Science, Engineering, or related field.Strong understanding of basic programming concepts.Familiarity with any programming languages (JavaScript, Python, Java, etc.) is a plus.Passion for learning new technologies and eagerness to pursue a career in Full Stack Development.Good communication skills and ability to work collaboratively in a team environment.Portfolio, personal projects, or any relevant experience demonstrating a basic understanding of web development concepts would be advantageous."},
  {"Title":"Junior Backend Developer","Location":"Pune, Maharashtra, India","Company":"Adeption","link":"https:\/\/in.linkedin.com\/jobs\/view\/junior-backend-developer-at-adeption-3757051409?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=OS7da4Ow2TeR1LtB02MU6w%3D%3D&position=17&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"As a Junior Backend Developer at Adeption, you will play a critical role in the design, development, and maintenance of our backend systems. This position is ideal for individuals with 0-2 years of experience who are passionate about software development, particularly in SQL Server, C#, and logic implementation. We are looking for an individual who works within a team to analyze, design, document, develop, test, and maintain primarily web-based applications for adoption using the desired technologies. He\/she should be familiar with standard concepts, practices, and procedures of a business environment, and rely on experience and judgment to plan and accomplish goals.ResponsibilitiesSQL Server Development: Develop, optimize, and maintain SQL Server databases and queries to ensure efficient data retrieval and storage.C# Development: Write clean, efficient, and well-documented C# code to implement backend functionalities and business logic.Logic Implementation: Implement complex business logic and algorithms to support the core functionality of our software products.API Integration: Integrate with external APIs and services to enhance product functionality.Bug Fixing and Troubleshooting: Identify and resolve backend issues, ensuring the stability and performance of our applications.Code Testing: Write unit tests and participate in code reviews to maintain code quality and reliability.Collaboration: Collaborate with cross-functional teams, including front-end developers, QA engineers, and product managers, to deliver high-quality software products.Documentation: Create and maintain technical documentation to facilitate knowledge sharing and onboarding of new team members.RequirementsBachelor's degree in computer science with a minimum of 0-2 years of experienceGood communication skillStrong Team PlayerProven troubleshooting and debugging skillsStrong knowledge of. NET Framework (4.0\/4.5), C#, ASP. NET MVC, JavaScript.Familiarity with architecture styles APIs (REST, RPC)Sound understanding of Database concepts & experience with SQL SERVERKnowledge of Agile methodologiesAwareness any of revision control systems like Git\/SVN\/TFS\/VSS etc.This job was posted by Krutika Deshmukh from Adeption."},
  {"Title":"Full Stack  - Fresher Training and Placements","Location":"Pune, Maharashtra, India","Company":"Optical Arc Pvt. Ltd.","link":"https:\/\/in.linkedin.com\/jobs\/view\/full-stack-fresher-training-and-placements-at-optical-arc-pvt-ltd-3778550019?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=P4zOX8LnGlKgqgAiwa%2BJSQ%3D%3D&position=18&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"Job Title: Full Stack Developer - Fresher Training and Placements.Company OverviewOptical Arc Pvt Ltd is seeking highly motivated and passionate individuals interested in pursuing a career as a Full Stack Developer. This is a training and placement opportunity for fresher candidates who have a strong desire to learn and excel in the field of web development.Position OverviewWe are looking for enthusiastic individuals to join our comprehensive training program designed to equip candidates with the skills necessary to become proficient Full Stack Developers. This role involves hands-on training in both front-end and back-end technologies, focusing on building robust and scalable web applications.ResponsibilitiesParticipate in a structured training program covering HTML, CSS, JavaScript, front-end frameworks (such as React, Angular, or Vue.js), and back-end technologies (such as Node.js, Python, or Java).Collaborate with mentors and trainers to understand best practices in software development and apply them to real-world projects.Engage in problem-solving and debugging exercises to enhance technical skills.Actively contribute to the development of web applications and projects under the guidance of senior developers.Demonstrate continuous learning and improvement in coding practices and development methodologies.RequirementsA degree in Computer Science, Engineering, or related field.Strong understanding of basic programming concepts.Familiarity with any programming languages (JavaScript, Python, Java, etc.) is a plus.Passion for learning new technologies and eagerness to pursue a career in Full Stack Development.Good communication skills and ability to work collaboratively in a team environment.Portfolio, personal projects, or any relevant experience demonstrating a basic understanding of web developmentconcepts would be advantageous."},
  {"Title":"Frontend UI Developer - Javascript\/HTML5\/CSS3","Location":"Pune, Maharashtra, India","Company":"Taliun","link":"https:\/\/in.linkedin.com\/jobs\/view\/frontend-ui-developer-javascript-html5-css3-at-taliun-3627621618?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=BkJeuFaIgAQ7%2FvoYNFZpUg%3D%3D&position=19&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":""},
  {"Title":"Interesting Job Opportunity: Robosoft Technologies - Java Spring Boot Developer - J2EE\/Hibernate","Location":"Pune, Maharashtra, India","Company":"Robosoft Technologies","link":"https:\/\/in.linkedin.com\/jobs\/view\/interesting-job-opportunity-robosoft-technologies-java-spring-boot-developer-j2ee-hibernate-at-robosoft-technologies-3768101553?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=0uRO%2B2OvMBmiY%2FQFFbVm3w%3D%3D&position=20&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"Job DescriptionRoles & Responsibilities : Experience in developing applications using Core Java and J2EE Knowledge of JSP and Servlets Knowledge of Design Patterns Experience in frameworks like Spring MVC, Spring Boot and Java Play Experience in any ORM tools like Hibernate, JPA, Ebean Knowledge of using RDBMS like MySQL and Oracle Using any of the application servers like Tomcat, JBoss, Weblogic etc. Basic knowledge of HTML5, JavaScript, CSS and JQuery(ref:hirist.com)"},
  {"Title":"Java Developer","Location":"Pune, Maharashtra, India","Company":"Entytle, Inc.","link":"https:\/\/in.linkedin.com\/jobs\/view\/java-developer-at-entytle-inc-3627625141?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=%2BsEjfdGBmDtQ3BP1uaxKkw%3D%3D&position=21&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"Candidate should possess good programming skills and should have worked in building out SAAS products. Preferably a full stack developer.About EntytleEntytle’s cloud-based software creates highly qualified opportunities for the aftermarket business, driving top-line growth, improved sales cycle time and predictable revenue. With Entytle, aftermarket sales teams have actionable and timely insights into customers’ needs and can close more sales in less time.How? Our Aftermarket Automation System aggregates and enriches customer data, analyzes customer history and behavior using sophisticated machine learning and statistical analysis, and surfaces actionable customer insights to drive aftermarket revenue growth.Entytle is a 2016 Red Herring – North America Top 100 Company. The company has funding from Accel Partners, is headquartered in Palo Alto, CA, and is hiring awesome, entrepreneurial employees to join the rapidly growing team. Skills:- Java, Spring, Hibernate (Java), RESTful APIs and MySQL"},
  {"Title":"SDE - I [ Full-Stack ]","Location":"Pune, Maharashtra, India","Company":"Townscript","link":"https:\/\/in.linkedin.com\/jobs\/view\/sde-i-full-stack-at-townscript-3727756685?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=WJC4b6tyyJHD9z1GwRCFQg%3D%3D&position=22&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"About TownhallTownhall is a highly differentiated B2B SaaS Hybrid events product backed by Bookmyshow and Marquee angels like Kunal Shah and Haresh Chawla among others. With deep expertise in the events space by way of over 50,000 Events in the past 5 years through our registrations business- Townscript, we look forward to build (townhall.co) into a unicorn and are looking for Smart Engineers who can help fulfill that vision !ResponsibilitiesOwn a functional area from product conception to deliveryGiven a product requirement, work with Product Managers to understand & re ne the requirements andtranslate them to technical requirementsChoose the right tech stack for a given requirementPrepare high-level designs with the help of Architects and Principal EngineersCome up with low-level design and code independently in multiple tech components related to functional areaOptimize existing microservicesTake non-functional requirement (Reliability, Availability, Scalability) into considerations while taking anydecisionOwning the quality of code, UT coverage, documentation etcCollaborate with teams by contributing to the shared vision and working closely with cross-functionalstakeholders.Requirements1-2.5 years of experience developing new age web products, distributed and scalable systemsStrong coding skills, data structures and algorithms, master level in at least one programming language like Java, Python, C++Strong object-oriented design skills and an uncanny ability to design intuitive module and class-level interfacesA good understanding of System Design, Design Patterns, Service Oriented Architecture and MicroservicesDeep experience in building web products using any of JS frameworks like Angular, React, Vue etc. with strong Javascript, HTML and CSS fundamentalsStrong experience in backend technologies like Java + Spring boot, RESTful webservicesKnowledge of different database services like RDBMS, NoSQL, FirebaseUnderstanding of streaming systems, Message queues like Kafka, RabbitMq etcKnow your eld: cutting edge tech and the right tools for the jobPrior work experience in an agile environment, continuous integration and continuous delivery (CI\/CD)Ability to work in an high performance driven startup environmentSkills: springboot,ut coverage,system design,java + spring boot,algorithms,c++,vue,css fundamentals,service oriented architecture,java,microservices,backend technologies,rabbitmq,python,javascript,high performance driven startup environment,js frameworks,restful webservices,continuous integration and continuous delivery (ci\/cd),cutting edge tech,data structures,message queues,react,design patterns,rdbms,coding skills,database services,high-level designs,object-oriented design skills,programming language,kafka,continuous integration,nosql,continuous delivery (ci\/cd),css,streaming systems,angular,agile environment,firebase,optimize existing microservices,tech stack,html"},
  {"Title":"Freshers from Engineer Background","Location":"Pune, Maharashtra, India","Company":"Ridlr","link":"https:\/\/in.linkedin.com\/jobs\/view\/freshers-from-engineer-background-at-ridlr-3627621679?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=gVld%2BMQLqi2NvXMi5%2FvyAg%3D%3D&position=23&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"Hello,We at Ridlr are looking to hire freshers who are willing to grow with lot of technical challenges of Startup .Candidates who list between 1- 5 top ranker in thier final year from below stream can connect with us.Candidate should have done atleast one hobby project. BioMedical Computer Electronics Electronics & Telecommunication Information Technology Skills:- Self learner, Internet of Things (IOT), enthusiastic, First 5 Toppers from Bio medical, Computers, Electronics, Electronics & Telecomuunication and Information Technology"},
  {"Title":"Firstcry - Intern - Search Engine Optimization","Location":"Pune, Maharashtra, India","Company":"FirstCry.com (BrainBees Solutions Pvt. Ltd.)","link":"https:\/\/in.linkedin.com\/jobs\/view\/firstcry-intern-search-engine-optimization-at-firstcry-com-brainbees-solutions-pvt-ltd-3759007232?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=kZ55l0yjgA98R6uQbNOTSQ%3D%3D&position=24&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"Job SpecificationsRequired (Must Have) skills : Hands-on experience with MS\/OPEN Office tools (Word, Excel, etc.) Good at English language: verbal & written communication Research oriented and willing to learn Interpersonal skills Fundamental SEO proficiency Keyword research ability Understanding of web contentQualification : GraduatesStipend : 7K per monthExperience : Freshers (Candidates with relevant professional training in digital marketing\/SEO preferable)Job Description The responsibilities include but is not limited to keyword research Identifying content opportunities Creating SEO based content specifications outline Content management through our CMS\/backend systems link building execution and if needed social content creation. Candidates will undergo training (relevant to the project and process).Project Description: (Project on which the new hire will work) : The project is pertaining to the Firstcry Shopping\/Parenting.Roles And Responsibilities Content research & exploration based on the topic shared Keyword research META creation SEO research Content handling link building(ref:updazz.com)"},
  {"Title":"SDE 1 (Java)","Location":"Pune, Maharashtra, India","Company":"intalk.io - Agami Tech Pvt Ltd.","link":"https:\/\/in.linkedin.com\/jobs\/view\/sde-1-java-at-intalk-io-agami-tech-pvt-ltd-3627613728?refId=6a66HgeCurPwzVTLJzSgkA%3D%3D&trackingId=Y95%2BTo6C%2FTfifClWdcuTYA%3D%3D&position=25&pageNum=0&trk=public_jobs_jserp-result_search-card","Description":"Responsibilities-Writing back-end code & front –end code and building efficient Java modulesContribute in all phases of the development lifecycle, Write well designed, testable, Design, build, and maintain efficient, reusable, and reliable Java code codeHelp maintain code quality, organization, and automatizationEnsure designs are in compliance with specificationsPrepare and produce releases of software componentsSupport continuous improvement by investigating alternatives and technologies and presenting these for architectural reviewTranslate application storyboards and use cases into functional applicationsEnsure the best possible performance, quality, and responsiveness of the applicationsIdentify bottlenecks and bugs, and devise solutions to these problemsAlign with organizational security protocols and data protection requirements andImplement the required featureParticipate in all phases of the SDLCSkills And Experience-BS\/MS Degree in Computer Science, Engineering or a related subjectHands-on experience in designing and developing applications using Java EE platformsObject-oriented analysis and design using common design patterns.Profound insight of Java and JEE internals (Class loading, Memory Management, Transaction management, etc.)excellent knowledge of Relational Databases, SQL, and ORM technologies (JPA2, Hibernate)Experience in the Spring FrameworkHands-on experience in designing and developing applications using JavaScript, j Query, and AJAX.Ensure that the APIs and services are adequate to support the applicationProfound insight of Java and JEE internals (Class loading, Memory Management, Transaction management etc.)Excellent knowledge of Relational Databases, SQL, and ORM technologies (JPA2, Hibernate)Experience with test-driven developmentexcellent written and verbal communication skills Ability to quickly adapt and learn new technologies.Collaborate with other parts of the technology team, including product, QA, etc. to deliver a solid product.Skills:- J2EE, Spring Boot, Hibernate (Java), AJAX, jQuery and MVC Framework"} 
  ]
  